       IDENTIFICATION  DIVISION.                                        
       PROGRAM-ID. HELLO-WORLD.
       AUTHOR. HARISH-KUMAR.
       DATE-WRITTEN 2025/07/04.

       DATA DIVISION.
       
       PROCEDURE DIVISION.
           DISPLAY "Hello, world!".
           STOP RUN.
           