       IDENTIFICATION  DIVISION.                                        
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       PROCEDURE DIVISION.
              DISPLAY "Hello, world!".
              STOP RUN.